In [1]:
import pandas as pd
import numpy as np

In [2]:
# 任务1： 将列表转化为Numpy数组
data0 = [2, 4, 6.5, 8]
arr0 = np.array(data0)

In [3]:
# 任务2： 新建Pandas中的Series数据类型，打印出其大小、索引值、值

In [4]:
# pandas中的Series数据类型
s = pd.Series(data=[100, 'a', { 'dic1': 5 }],
              index=pd.Index(['id1', 20, 'third'], name='my_idx'),
              dtype='object',
              name='my_name')

In [5]:
s2 = pd.Series(["1","2","3","4"])

In [6]:
s2.index.values

array([0, 1, 2, 3], dtype=int64)

In [7]:
type(s2.values[0])

str

In [8]:
s2.shape

(4,)

In [9]:
s2.size

4

In [10]:
# 任务3： 创建DataFrame类型的数据，并获取其索引、值及表大小
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}
df = pd.DataFrame(d)

In [11]:
# "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"])

In [12]:
d1 = {
    "作者":pd.Series(['余华','残雪','莫言']),
    "作品":pd.Series(['活着','暗夜','红高粱']),
    "价格":pd.Series([35,72,38]),
}
df2 = pd.DataFrame(d1)

In [13]:
df2.index.values

array([0, 1, 2], dtype=int64)

In [14]:
df2.shape

(3, 3)

In [15]:
df2.size

9

In [16]:
df2['作品']

0     活着
1     暗夜
2    红高粱
Name: 作品, dtype: object

In [17]:
df2[['作者','价格']]

   作者  价格
0  余华  35
1  残雪  72
2  莫言  38

In [18]:
df2.values

array([['余华', '活着', 35],
       ['残雪', '暗夜', 72],
       ['莫言', '红高粱', 38]], dtype=object)

In [19]:
贵州茅台原始数据 = pd.read_csv(R'data\600519.csv')

In [20]:
# 按列查询数据
贵州茅台原始数据['TURNOVER']

0        1410347008
1         463463008
2         194689000
3         177558000
4          86231000
           ...
4089     2694714080
4090    10663392512
4091     5239853056
4092     5581027328
4093     5227695104
Name: TURNOVER, Length: 4094, dtype: int64

In [21]:
贵州茅台原始数据[['TURNOVER','volume']]

         TURNOVER  volume
0      1410347008  406318
1       463463008  129647
2       194689000   53252
3       177558000   48013
4        86231000   23231
...           ...     ...
4089   2694714080   49076
4090  10663392512  204397
4091   5239853056   96885
4092   5581027328   98107
4093   5227695104   89157

[4094 rows x 2 columns]

In [22]:
# 按照行索引
贵州茅台原始数据.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [23]:
贵州茅台 = 贵州茅台原始数据.set_index('day')

In [24]:
# loc索引器
# 单个元素
贵州茅台.loc['2001-08-27']

STOCK_CODE    6.005191e+06
open          3.451000e+01
close         3.555000e+01
maximum       3.778000e+01
minimum       3.285000e+01
volume        4.063180e+05
TURNOVER      1.410347e+09
Name: 2001-08-27, dtype: float64

In [25]:
贵州茅台.loc['2001-08-27','close']

35.55

In [26]:
贵州茅台.loc['2001-08-27',['open','close']]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [27]:
贵州茅台.loc['2001-10-08',['open','close']]

open     37.00
close    36.58
Name: 2001-10-08, dtype: float64

In [ ]:
贵州茅台.loc['2001-08-27':'2001-10-08']

In [ ]:
条件1 = 贵州茅台['open'] < 35
条件2 = 贵州茅台['close'] < 35
布尔列表 = 条件1 & 条件2
贵州茅台.loc[布尔列表]

In [37]:
# 使用函数作为索引
def condition(pd):
    条件1 = pd['open'] < 35
    条件2 = pd['close'] < 35
    布尔列表 = 条件1 & 条件2
    return 布尔列表

In [ ]:
贵州茅台.loc[condition]

In [44]:
贵州茅台.query('open<35 and close <35')[['open','close']]

             open  close
day
2001-10-17  34.79  34.20
2001-10-18  34.20  34.04
2001-10-19  34.00  33.50
2001-10-22  33.30  32.79
2001-11-08  33.35  33.70
...           ...    ...
2004-09-21  32.09  32.30
2004-09-22  32.03  32.16
2004-09-23  32.11  33.42
2004-09-24  33.60  34.49
2004-09-27  34.95  34.93

[498 rows x 2 columns]

In [46]:
贵州茅台.sample(10)

            STOCK_CODE    open   close  maximum  minimum  volume    TURNOVER
day
2003-09-12     6005191   21.32   21.22    21.32    21.14    2803     5941702
2009-12-02     6005191  177.24  176.14   177.44   173.88   20596   362528928
2002-10-28     6005191   26.60   25.96    26.60    25.90    4472    11679872
2004-11-15     6005191   38.51   38.76    38.80    37.60    8948    34292416
2003-03-10     6005191   27.35   26.90    27.41    26.88    3103     8423721
2012-03-02     6005191  202.63  200.90   203.70   199.51   35217   706746816
2002-06-26     6005191   37.28   36.85    37.40    36.56   15423    56971879
2005-04-06     6005191   50.17   51.16    51.29    49.59    5675    28795816
2003-10-21     6005191   21.39   21.40    21.55    21.36     664     1421413
2016-04-11     6005191  250.50  243.72   255.18   243.50  119285  2930751136

In [47]:
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [51]:
贵州茅台.describe()

,STOCK_CODE,open,close,maximum,minimum,volume,TURNOVER
count,4094.0,4094.000000,4094.000000,4094.000000,4094.000000,4094.000000,4.094000e+03
mean,6005191.0,182.161910,182.435230,184.879680,179.801353,27092.525892,6.487986e+08
std,0.0,165.857882,165.994905,168.082099,163.752065,24623.472099,9.550262e+08
min,6005191.0,20.900000,20.880000,21.000000,20.710000,238.000000,1.421413e+06
25%,6005191.0,47.405000,47.482500,48.222500,46.705000,10186.750000,6.203505e+07
50%,6005191.0,159.930000,159.980000,161.910000,157.875000,22491.000000,3.727192e+08
75%,6005191.0,208.500000,209.457500,212.175000,205.945000,36759.500000,7.486596e+08
max,6005191.0,800.000000,799.190000,803.500000,788.880000,406318.000000,1.066339e+10

In [54]:
result = 贵州茅台['open'].unique()

In [55]:
result2 = 贵州茅台['open'].nunique()

In [56]:
result3 = 贵州茅台['open'].value_counts()

In [60]:
df = pd.DataFrame({
    "name": ["A", "B", "C", "B", "C", "A", "C"],
    "value": [1, 3, 7, 2, 4, 3, 1]
})
df.groupby("name")["value"].min()

name
A    1
B    2
C    1
Name: value, dtype: int64